# CustomerAddress

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

from datetime import datetime, date
plt.style.use('ggplot')

import warnings
warnings.filterwarnings('ignore')

In [2]:
cust_address = pd.read_excel("C:/Users/ASUS/Documents/Prwatech Project work/Customer_Retail_Transaction_Dataset.xlsx",sheet_name='CustomerAddress')

In [3]:
cust_address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [4]:
cust_address.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [5]:
cust_address.describe()

       customer_id     postcode  property_valuation
count  3999.000000  3999.000000         3999.000000
mean   2003.987997  2985.755939            7.514379
std    1154.576912   844.878364            2.824663
min       1.000000  2000.000000            1.000000
25%    1004.500000  2200.000000            6.000000
50%    2004.000000  2768.000000            8.000000
75%    3003.500000  3750.000000           10.000000
max    4003.000000  4883.000000           12.000000

In [6]:
# Total number of missing values
cust_address.isna().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [7]:
# Total Records

In [8]:
print("Total records (rows) in the dataset : {}".format(cust_address.shape[0]))
print("Total columns (features) in the dataset : {}".format(cust_address.shape[1]))

Total records (rows) in the dataset : 3999
Total columns (features) in the dataset : 6

In [9]:
# Numeric Columns and Non-Numeric Columns

In [10]:
# select numeric columns
df_numeric = cust_address.select_dtypes(include=[np.number])
numeric_cols = df_numeric.columns.values
print("The numeric columns are : {}".format(numeric_cols))


# select non-numeric columns
df_non_numeric = cust_address.select_dtypes(exclude=[np.number])
non_numeric_cols = df_non_numeric.columns.values
print("The non-numeric columns are  : {}".format(non_numeric_cols))

The numeric columns are : ['customer_id' 'postcode' 'property_valuation']
The non-numeric columns are  : ['address' 'state' 'country']

In [11]:
# Inconsistency Check in Data

In [12]:
# State

In [13]:
cust_address['state'].value_counts()

state
NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: count, dtype: int64

Here there are inconsistent data in State column. For New South Wales and Victoria we have two values, one being the full name and the other being their short name. The State names should be standardised and columns with state as New South Wales will be replaced by NSW and columns with state as Victoria will be replaced by VIC.

In [14]:
# Function to replace full state names with their short forms.

def replace_state_names(state_name):
    
    # Making Short Form of State Names as standards
    if state_name=='New South Wales':
        return 'NSW'
    elif state_name=='Victoria':
        return 'VIC'
    else :
        return state_name

# Applying the above fuction to state column
cust_address['state'] = cust_address['state'].apply(replace_state_names)

In [15]:
cust_address['state'].value_counts()

state
NSW    2140
VIC    1021
QLD     838
Name: count, dtype: int64

In [16]:
# Country

In [17]:
cust_address['country'].value_counts()

country
Australia    3999
Name: count, dtype: int64

In [18]:
# Postcode

In [19]:
cust_address['postcode'].value_counts()

postcode
2170    31
2155    30
2145    30
2153    29
3977    26
        ..
3808     1
3114     1
4721     1
4799     1
3089     1
Name: count, Length: 873, dtype: int64

In [20]:
cust_address[['address','postcode', 'state' , 'country']].drop_duplicates()

                        address  postcode state    country
0            060 Morning Avenue      2016   NSW  Australia
1           6 Meadow Vale Court      2153   NSW  Australia
2            0 Holy Cross Court      4211   QLD  Australia
3           17979 Del Mar Point      2448   NSW  Australia
4              9 Oakridge Court      3216   VIC  Australia
...                         ...       ...   ...        ...
3994            1482 Hauk Trail      3064   VIC  Australia
3995  57042 Village Green Point      4511   QLD  Australia
3996     87 Crescent Oaks Alley      2756   NSW  Australia
3997           8194 Lien Street      4032   QLD  Australia
3998            320 Acker Drive      2251   NSW  Australia

[3999 rows x 4 columns]

# Duplication Checks
We need to ensure that there is no duplication of records in the dataset. This may lead to error in data analysis due to poor data quality. If there are duplicate rows of data then we need to drop such records.
For checking for duplicate records we need to firstly remove the primary key column of the dataset then apply drop_duplicates() function provided by Python.

In [21]:
# Dropping the primary key column i.e customer_id and storing into a temporary dataframe.
cust_address_dedupped = cust_address.drop('customer_id', axis=1).drop_duplicates()

print("Number of records after removing customer_id (pk), duplicates : {}".format(cust_address_dedupped.shape[0]))
print("Number of records in original dataset : {}".format(cust_address.shape[0]))

Number of records after removing customer_id (pk), duplicates : 3999
Number of records in original dataset : 3999

Since both the numbers are same. There are no duplicate records in the dataset

# Exporting the Cleaned Customer Demographic Data Set to csv

Currently the Customer Address dataset is clean. Hence we can export the data to a csv to continue our data analysis of Customer Segments by joining it to other tables.

In [22]:
import os

# Check if the directory exists, if not, create it
if not os.path.exists('Data_Cleaned'):
    os.makedirs('Data_Cleaned')

In [23]:

# Now save the CSV file
# cust_address.to_csv('Data_Cleaned/CustomerAddress_Cleaned.csv', index=False)

# Checking for Master-Detail Record Counts

Checking with the Master Table (CustomerDemographic_Cleaned.csv) containing the entire Customer Data for the Customer IDs which are getting dropped from the Customer Address Dataset.
Basically these are the Customers who have an address but are not a part of the Demographics dataset yet.

In [24]:
cust_demo_detail = pd.read_csv(r"C:\Users\ASUS\Documents\Prwatech Project work\Data_Cleaned\CustomerAddress_Cleaned.csv")
cust_demo_detail.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [25]:
print("Total Records in Customer_Demographic_Table : {}".format(cust_demo_detail.shape[0]))
print("Total Records in Customer_Address_Table : {}".format(cust_address.shape[0]))
print('In Demographic Table {} records are getting dropped due to data cleaning process in Demographic Table'
      .format(cust_address.shape[0]-cust_demo_detail.shape[0]))

Total Records in Customer_Demographic_Table : 3999
Total Records in Customer_Address_Table : 3999
In Demographic Table 0 records are getting dropped due to data cleaning process in Demographic Table

In [26]:
# Customer IDs in Address table getting dropped

In [28]:
cust_drop = cust_address.merge(cust_demo_detail , left_on = 'customer_id', right_on='customer_id'
                     , how='outer')
cust_drop.head()

,customer_id,address_x,postcode_x,state_x,country_x,property_valuation_x,address_y,postcode_y,state_y,country_y,property_valuation_y
0,1,060 Morning Avenue,2016,NSW,Australia,10,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9,9 Oakridge Court,3216,VIC,Australia,9

In [31]:
df1 = pd.read_csv(r"Data_Cleaned/CustomerDemographic_Cleaned.csv")
df1.head()

,customer_id,name,gender,past_3_years_bike_related_purchases,DOB,age,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,Age
0,720,Darrel Canet,Male,67,1931-10-23,92.0,Recruiting Manager,Retail,Affluent Customer,N,No,6.0,92
1,1092,Katlin Creddon,Female,56,1935-08-22,89.0,VP Quality Control,Retail,Mass Customer,N,No,5.0,89
2,3410,Merrili Brittin,Female,93,1940-09-22,83.0,Missing,Property,Mass Customer,N,No,16.0,83
3,658,Donn Bonnell,Male,38,1944-01-24,80.0,Tax Accountant,Manufacturing,Affluent Customer,N,Yes,8.0,80
4,2413,Abbey Murrow,Male,27,1943-08-11,81.0,Environmental Specialist,Manufacturing,High Net Worth,N,Yes,17.0,81

In [33]:
merged_df  = pd.merge(cust_address,df1,on = "customer_id" , how = "outer")
merged_df.head()

,customer_id,address,postcode,state,country,property_valuation,name,gender,past_3_years_bike_related_purchases,DOB,age,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,Age
0,1,060 Morning Avenue,2016.0,NSW,Australia,10.0,Laraine Medendorp,Female,93.0,1953-10-12,70.0,Executive Secretary,Health,Mass Customer,N,Yes,11.0,70.0
1,2,6 Meadow Vale Court,2153.0,NSW,Australia,10.0,Eli Bockman,Male,81.0,1980-12-16,43.0,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,43.0
2,3,NaN,NaN,NaN,NaN,NaN,Arlin Dearle,Male,61.0,1954-01-20,70.0,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,70.0
3,4,0 Holy Cross Court,4211.0,QLD,Australia,9.0,Talbot,Male,33.0,1961-10-03,62.0,Missing,IT,Mass Customer,N,No,7.0,62.0
4,5,17979 Del Mar Point,2448.0,NSW,Australia,4.0,Sheila-kathryn Calton,Female,56.0,1977-05-13,47.0,Senior Editor,Missing,Affluent Customer,N,Yes,8.0,47.0

In [35]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4003 entries, 0 to 4002
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4003 non-null   int64
 1   address                              3999 non-null   object
 2   postcode                             3999 non-null   float64
 3   state                                3999 non-null   object
 4   country                              3999 non-null   object
 5   property_valuation                   3999 non-null   float64
 6   name                                 3912 non-null   object
 7   gender                               3912 non-null   object
 8   past_3_years_bike_related_purchases  3912 non-null   float64
 9   DOB                                  3912 non-null   object
 10  age                                  3912 non-null   float64
 11  job_title                            3912 non-null   object
 12  job_industry_category                3912 non-null   object
 13  wealth_segment                       3912 non-null   object
 14  deceased_indicator                   3912 non-null   object
 15  owns_car                             3912 non-null   object
 16  tenure                               3912 non-null   float64
 17  Age                                  3912 non-null   float64
dtypes: float64(6), int64(1), object(11)
memory usage: 563.1+ KB